{"architecture":{"class_name":"Functional","config":{"name":"sequential_2","trainable":true,"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"registered_name":null,"name":"input_1","inbound_nodes":[]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_6","trainable":true,"dtype":"float32","batch_input_shape":[null,4],"units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,4]},"name":"dense_6","inbound_nodes":[[["input_1",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_7","trainable":true,"dtype":"float32","units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_7","inbound_nodes":[[["dense_6",0,0,{}]]]},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_8","trainable":true,"dtype":"float32","units":2,"activation":"linear","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"registered_name":null,"build_config":{"input_shape":[null,10]},"name":"dense_8","inbound_nodes":[[["dense_7",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_8",0,0]]},"keras_version":"2.13.1","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[4]],"output_shapes":[[2]],"tests":[{"inputs":[{"shape":[4],"values":["F2lbPuk7i7+K+04/Q/Ydvg=="]}],"outputs":[{"shape":[2],"values":["vByvP8W4nD8="]}]}],"trainable_params":{"dense_6":{"weights":["/ypIQFUaD7/bZMC/xb0yQE9Q3L+VjQi/PLIHQB5S0L8/fPE/0STpvwQhjz5Ki/u/L9pRvRl2Xb4qKAc/WhJPP5uQO77J+TG+RFUBP5BUur2YnfK88BJDP6zMhD9ELSK/3upbv6u8AD8+hyu/Ll1GP0B6e78Xdn4/GLYUPLa1FjyZTdY9kwxyPv1dKj2QchA9t+ASPct7vz7HuUM+gaDLvQ=="],"bias":["xQK0P9EtEr59qiy/clMuP+VujT9qE4q/BzmRP5E5rb/Rmog/7Oxmvg=="]},"dense_7":{"weights":["WnCNv14W0r283IK+bErvvi7q876dNo6/QmGSv825sD1QhUU/JAsxvedxjb+Tyea9thngPrLLyj6jDpm+UjM6wIeloL8cqUhAaSoiQJrwPj7aZQo/vu9PPqDXAb9Tj+6+I92KPwbYYT9gy40/G65VPoS2Yb+Ii7w9uwCPv+HL7z/ksqC9AuenvvDcmTkV6dC+vR4Yv/xbBcAYS6y/JQ8qPZrJqL96WNC/s/OLvoQ/P7546M+/b2C3v4lE3L92WDI/L2koP3aNKL6e5dW+8/wav5/M4b7QKlc+NpiuvqFgMD/Iayo+yLSqPsUNlL5jSCW/dRAEwcNCILvylpc+UlVIvmRgGUAAkoTAIXxdwM4hTkCFlsk/6qQ8vyipIz8dBGC+sOK9vqvv5r4BcWk+Be4cP3XcET+zndw+X4cyvxZqXb+OWK6+ozR8v4s2xr680Om+CtSBvkVW9L6dH+M+d3pYv5XsPj/lN8o/VFjMP10VqT+QbwE9Rs8Yvq8+mD9POIQ/8tORP4r4pz4xpgi/TO3lvg=="],"bias":["9ihUPVm7hD8AAAAAAAAAAMA5TT4Nm709oskbv20EU78AZDQ/6q/oPw=="]},"dense_8":{"weights":["ERgIPm2lHcCiTbw+DN+fPyy/Hz6Ay5M9ePsKv03Owb5nyrK9rxKbv7yG1j5krj3AblDlvaN4icBFu968OtAWP9Odoj1yBCW/fKibvXOwsD8="],"bias":["SzpLPa1hrL8="]}},"hash":"f680c6cdf58f6772f580dbe474c48055c5ea1e46760f2c1f9158b8f38006b26a"}